# 01-打印“Hello，World！”
print("Hello World!")


# 02-输入两个数字，并计算他们的和
x = int(input("请您输入x的值:"))
y = int(input("请您输入y的值:"))
x = x+y
print(x)


# 03-输入一个数字，判断他是奇数还是偶数（当x%2去余数为0则为偶数否则为奇数）
x = int(input("请您输入x的值："))
if x % 2 == 0:
    print("x为偶数",x)
    print(f"{x}是偶数")
else:
    print("x为奇数",x)
    print(f"{x}是奇数")


# 04-输入一个年份，判断它是否是闰年


# 05-输入一个数字n，计算1+2+3+...+n的和

# 06-输入一个数字n，计算n的阶乘

# 07-打印乘法口诀表（9x9）

# 08-输入一个数字，判断它是否是素数

# 09-输入一个字符串，打印出字符串的长度

# 10-输入一个字符串，将其反转并输出

# 11-输入一个数字n，打印斐波那契数列的前n项

# 12-输入一个数字，将其分解质因数

# 13-输入一个数字n，打印一个边长为n的正方形（用*号）

# 14-输入一个数字n，打印一个直角三角形（用*号）

# 15-输入一个数字n，打印一个等腰三角形（用*号）

# 16-输入一个数字n，打印一个菱形（用*号）

# 17-输入一个数字n，打印一个空心正方形（用*号）

# 18-输入一个数字n，打印一个空心三角形（用*号）

# 19-输入一个数字n，打印一个空心菱形（用*号）

# 20-输入一个数字n，打印一个数字金字塔（例如：1, 121, 12321等）

